#include <iostream> 
#include <cstdlib> 
using namespace std; 

// Данный пример визуализирует распределение элементов массива 'values' из чисел на линии соотвествующей 100%
// В таком виде:
//
// XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX.............86.4553%                      
// X...................................................................................................0.0576369%                    
// X...................................................................................................0.0576369%                    
// XXXX................................................................................................3.57349%                      
// XXXXXX..............................................................................................5.30259%                      
// X...................................................................................................0.115274%                     
// XXXX................................................................................................3.57349%                      
// X...................................................................................................0.172911%                     
// X...................................................................................................0.345821%                     
// X...................................................................................................0.345821%                     
// total sum: 1735 is a 100%    

// 
int main() 
{ 
int values[10] = { 1500, 1, 1, 62, 92, 2, 62, 3, 6, 6 }; 

double summa=0; 
double percent[10]; 
double percentsumma=0; 

for (int i=0; i<10; ++i) 

{ 
summa=summa +values[i]; 

} 

for (int i=0; i<10; ++i) 

{ 
percent[i] = summa / values[i]; 
percent[i] = 100 / percent[i]; 
percentsumma = percentsumma + percent[i]; 
} 




for (int i=0; i<10; ++i) 

{ 




for (int ii=0; ii<100; ++ii) 
{ 
//заполняем бар иксами
if(ii<percent[i]) cout << "X"; 
//заполняем оставшийся бар точками
if(ii>percent[i]) cout << "."; 
} 
cout << percent[i] << "%" << endl; 
} 


cout << "total sum: " << summa << " is a " << percentsumma << "%" << endl; // Пытаемся вывести сумму массива 


return EXIT_SUCCESS; 

}